Catalogs/УчетныеЗаписиЭлектронныхТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектронныхТорговыхПлощадок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЭТП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭлектронныхТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДанныхРегистрации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектронныхТорговыхПлощадок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ПометкаУдаления Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УчетныеЗаписиЭТП.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭТП
		|ГДЕ
		|	УчетныеЗаписиЭТП.Ссылка <> &Ссылка
		|	И УчетныеЗаписиЭТП.ВидЭТП = &ВидЭТП
		|	И УчетныеЗаписиЭТП.Сервер = &Сервер
		|	И УчетныеЗаписиЭТП.Организация = &Организация
		|	И НЕ УчетныеЗаписиЭТП.ПометкаУдаления";

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сервер", Сервер);
		Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);

		Если Не РезультатЗапроса.Пустой() Тогда

			ТекстОшибки = НСтр(
				"ru='Для организации ""%1"" уже существует активная учетная запись. Создание новой учетной записи невозможно.'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстОшибки, Строка(Организация)), , , , Отказ);

		КонецЕсли;
	КонецЕсли;
	
	// Заполнение наименования
	ИменаСерверов = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.ИменаСерверовБидзаар();
	ЭлементСписка = ИменаСерверов.НайтиПоЗначению(Сервер);
	Если ЭлементСписка <> Неопределено Тогда
		ПредставлениеСервера = ЭлементСписка.Представление;
	Иначе
		ПредставлениеСервера = НСтр("ru = 'Рабочий'");
	КонецЕсли;
	Наименование = СтрШаблон("%1 (%2)", Строка(Организация), ПредставлениеСервера);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики Или
		ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда
		
		ИнтеграцияСЭлектроннымиТорговымиПлощадками.ОчиститьТокены(ВидЭТП, Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
